Repository: CofficLab/GitOK
Catalog: Packages/PluginGitAutoPush/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: A new local commit is created.
zh_hans: 创建了一条新的本地提交。
zh_hk: 創建了一條新的本地提交。

source: Auto Push
zh_hans: 自动推送
zh_hk: 自動推送

source: Auto-push after commit
zh_hans: 提交后自动推送
zh_hk: 提交後自動推送

source: Auto-push is disabled - Click to configure
zh_hans: 自动推送已禁用 - 点击配置
zh_hk: 自動推送已停用 - 點擊設定

source: Auto-push is enabled - Click to manage
zh_hans: 自动推送已启用 - 点击管理
zh_hk: 自動推送已啟用 - 點擊管理

source: Auto-push runs against the configured remote.
zh_hans: 自动推送按配置的远程执行。
zh_hk: 自動推送按配置的遠程執行。

source: Automatic
zh_hans: 自动
zh_hk: 自動

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: Commit lands
zh_hans: 提交落地
zh_hk: 提交落地

source: Configurable
zh_hans: 可配置
zh_hk: 可配置

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Enable or disable auto-push for each repository.
zh_hans: 可逐仓库启用或关闭自动推送。
zh_hk: 可逐倉庫啓用或關閉自動推送。

source: Failed pushes are surfaced instead of silently retried.
zh_hans: 推送失败会明确呈现，而非静默重试。
zh_hk: 推送失敗會明確呈現，而非靜默重試。

source: Failure Awareness
zh_hans: 失败感知
zh_hk: 失敗感知

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: New commits are pushed to the tracked remote automatically.
zh_hans: 新提交自动推送到所跟踪的远程。
zh_hk: 新提交自動推送到所跟蹤的遠程。

source: Per-Project Control
zh_hans: 按项目控制
zh_hk: 按項目控制

source: Please select a project first
zh_hans: 请先选择一个项目
zh_hk: 請先選擇一個專案

source: Push on Commit
zh_hans: 提交即推送
zh_hk: 提交即推送

source: Push triggers
zh_hans: 触发推送
zh_hk: 觸發推送

source: Safe
zh_hans: 安全
zh_hk: 安全

source: Save
zh_hans: 保存
zh_hk: 儲存

source: The remote ref is confirmed and status updates.
zh_hans: 确认远程引用并更新状态。
zh_hk: 確認遠程引用並更新狀態。

source: Verify
zh_hans: 验证
zh_hk: 驗證

source: When enabled, GitOK pushes the current branch after every successful commit.
zh_hans: 启用后，GitOK 会在每次提交成功后推送当前分支。
zh_hk: 啟用後，GitOK 會在每次提交成功後推送目前分支。

source: Your commits travel to the remote on their own.
zh_hans: 你的提交自动前往远程。
zh_hk: 你的提交自動前往遠程。

source: manual pushes
zh_hans: 手动推送
zh_hk: 手動推送

source: sync
zh_hans: 同步
zh_hk: 同步
